In [97]:
import numpy as np
import pandas as pd 
import seaborn as sns

In [98]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

### mean() 평균

In [65]:
arr = np.arange(15).reshape(3,5)
temp_df = pd.DataFrame(arr)
temp_df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [66]:
temp_df.mean()

0    5.0
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

In [67]:
 df.mean(numeric_only = True) #수치형 데이터

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [68]:
df['age'].mean()

29.69911764705882

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [70]:
cond = df['adult_male'] == True
df.loc[cond,'age'].mean()

33.17312348668281

- fare 를 30 이상 40미만 지불한 승객 
- pclass 1 등급 
=> 나이 평균 / count

In [71]:
cond = (df['fare'] >= 30 )& (df['fare'] < 40)
cond1 = df['pclass'] == 1

In [72]:
df.loc[cond& cond1,'age'].mean()

44.095238095238095

In [73]:
df.loc[cond& cond1,'age'].count()

21

In [74]:
df.loc[cond& cond1,'age'] #평균 넣을 때 Nan 값 skip 하는게 default

23     28.0
55      NaN
96     71.0
170    61.0
174    56.0
209    40.0
270     NaN
298     NaN
339    45.0
351     NaN
449    52.0
462    47.0
492    55.0
515    47.0
556    48.0
607    27.0
625    61.0
630    80.0
632    32.0
647    56.0
740     NaN
766     NaN
782    29.0
793     NaN
842    30.0
853    16.0
887    19.0
889    26.0
Name: age, dtype: float64

In [75]:
df.mean(numeric_only=True, skipna=False)

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [76]:
pd.Series([1,2,3,4,5]).median()

3.0

In [77]:
pd.Series([1,2,3,4,9]).median()

3.0

In [78]:
mean_value = df['age'].mean()
median_value = df['age'].median()
print(mean_value, median_value)

29.69911764705882 28.0

In [79]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [80]:
df['fare'].cumsum()

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

### var(분산)

In [81]:
#평균
fare_mean = df['fare'].values.mean()

total = ((df['fare'].values - fare_mean) ** 2).sum()
total_count = df['fare'].count() - 1
my_var = total / total_count
my_var

2469.436845743116

In [82]:
df['fare'].var()

2469.436845743116

### std

In [83]:
np.sqrt(df['fare'].var())

49.6934285971809

### min, max

In [84]:
df['age'].min()

0.42

In [85]:
df['age'].max()

80.0

### agg

In [86]:
df[['age','fare']].agg(['mean', 'count' ,'min', 'max'])

              age        fare
mean    29.699118   32.204208
count  714.000000  891.000000
min      0.420000    0.000000
max     80.000000  512.329200

### qunatile(분위)

In [88]:
df['age'].quantile(0.1)

14.0

In [89]:
df['age'].quantile(0.9)

50.0

### mod

In [94]:
df['who'].mode()

0    man
Name: who, dtype: object

### corr

In [104]:
df.corr()['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64